embeddedci-com/examples/scenario-sensors-stm32/main.c
/*
 * STM32 scenario app:
 * - USART1 interactive menu (line-buffering off for interactive echo)
 * - rotor outputs on PC10/PC11
 * - BMP280 on I2C1 (PB8/PB9), auto-detect 0x76/0x77
 * - VL53L0X on same bus (default addr 0x29) for bus validation
 */

#include "stm32f4xx_hal.h"
#include <math.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#define CMD_BUF_SIZE 64
#define BMP280_CHIP_ID 0x58U
#define BMP280_REG_CHIP_ID 0xD0U
#define BMP280_REG_RESET 0xE0U
#define BMP280_REG_STATUS 0xF3U
#define BMP280_REG_CTRL_MEAS 0xF4U
#define BMP280_REG_CONFIG 0xF5U
#define BMP280_REG_PRESS_MSB 0xF7U
#define BMP280_REG_CALIB_START 0x88U

#define BMP280_I2C_ADDR0 0x76U
#define BMP280_I2C_ADDR1 0x77U
#define BMP280_TIMEOUT_MS 100U
#define BMP280_SEA_LEVEL_PA 101325.0f

#define VL53L0X_I2C_ADDR_7B 0x29U
#define VL53L0X_REG_IDENTIFICATION_MODEL_ID 0xC0U
#define VL53L0X_MODEL_ID_EXPECTED 0xEEU
#define VL53L0X_REG_SYSRANGE_START 0x00U
#define VL53L0X_REG_SYSTEM_INTERRUPT_CLEAR 0x0BU
#define VL53L0X_REG_RESULT_INTERRUPT_STATUS 0x13U
#define VL53L0X_REG_RESULT_RANGE_MM 0x1EU
#define VL53L0X_RANGE_READY_MASK 0x07U
#define VL53L0X_RANGE_TIMEOUT_MS 100U

#define I2C_SCAN_ADDR_FIRST 0x08U
#define I2C_SCAN_ADDR_LAST 0x77U
#define I2C_ISREADY_TRIALS 3U
#define I2C_ISREADY_TIMEOUT_MS 10U

typedef struct
{
    uint16_t dig_T1;
    int16_t dig_T2;
    int16_t dig_T3;
    uint16_t dig_P1;
    int16_t dig_P2;
    int16_t dig_P3;
    int16_t dig_P4;
    int16_t dig_P5;
    int16_t dig_P6;
    int16_t dig_P7;
    int16_t dig_P8;
    int16_t dig_P9;
    int32_t t_fine;
} bmp280_calibration_t;

typedef struct
{
    I2C_HandleTypeDef hi2c1;
    uint8_t i2c_addr_7b;
    uint8_t detected;
    uint8_t initialized;
    uint32_t read_count;
    uint32_t read_fail_count;
    float temperature_c;
    float pressure_pa;
    float altitude_m;
} sensor_state_t;

typedef struct
{
    uint8_t detected;
    uint8_t initialized;
    uint8_t last_model_id;
    uint16_t last_range_mm;
    uint32_t read_count;
    uint32_t read_fail_count;
} vl53l0x_state_t;

static volatile char cmd_buffer[CMD_BUF_SIZE];
static volatile uint8_t cmd_index = 0;
static volatile uint8_t cmd_ready = 0;

static uint8_t rx_byte;
static volatile uint32_t rx_byte_count = 0;
static volatile uint32_t command_count = 0;
static uint8_t rx_last_was_cr = 0U;

static sensor_state_t g_sensor;
static bmp280_calibration_t g_calib;
static vl53l0x_state_t g_vl53;
static uint8_t g_i2c1_hw_inited = 0U;

void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void USART1_Init(void);
static void I2C1_Init(void);
static int i2c1_ensure_init(void);
void HAL_I2C_MspInit(I2C_HandleTypeDef *hi2c);
void HAL_I2C_MspDeInit(I2C_HandleTypeDef *hi2c);
static int usart1_read_byte_nonblocking(uint8_t *byte);
static void uart_process_rx_byte(uint8_t byte);
static void print_prompt(void);
static void process_command(char *cmd);
static void print_help(void);
static void print_status(void);
static void set_rotors(GPIO_PinState state);
static void monitor_i2c_until_key(void);
static void sensor_init_until_key(void);
static int bmp280_probe_and_init(uint8_t verbose);
static int bmp280_read_measurement(float *temperature_c, float *pressure_pa, float *altitude_m);
static int bmp280_read_regs(uint8_t reg, uint8_t *buf, uint16_t len, uint8_t verbose);
static int bmp280_write_reg(uint8_t reg, uint8_t value, uint8_t verbose);
static void i2c_dump_hal_context(const char *tag, HAL_StatusTypeDef st);
static void i2c_dump_hal_error_bits(uint32_t err);
static void i2c_bus_scan(void);
static int vl53l0x_init(uint8_t verbose);
static int vl53l0x_read_model_id(uint8_t verbose);
static int vl53l0x_read_range_mm(uint16_t *range_mm, uint8_t verbose);
static int sensor_i2c_deinit(void);
static const char *hal_status_to_str(HAL_StatusTypeDef status);
static int32_t bmp280_compensate_temp(int32_t adc_T);
static uint32_t bmp280_compensate_press(int32_t adc_P);
static float pressure_to_altitude_m(float pressure_pa);
static void fault_led_prepare(void);
static void fault_led_delay(volatile uint32_t cycles);
static void fault_led_blink_loop(uint32_t pulses) __attribute__((noreturn));

int _write(int file, char *ptr, int len)
{
    (void)file;
    for (int i = 0; i < len; i++)
    {
        while ((USART1->SR & USART_SR_TXE) == 0U)
        {
        }
        USART1->DR = (uint8_t)ptr[i];
    }
    return len;
}

int main(void)
{
    HAL_Init();
    SystemClock_Config();
    MX_GPIO_Init();
    USART1_Init();
    (void)setvbuf(stdout, NULL, _IONBF, 0);

    memset(&g_sensor, 0, sizeof(g_sensor));
    memset(&g_vl53, 0, sizeof(g_vl53));
    I2C1_Init();
    (void)bmp280_probe_and_init(1U);
    printf("\r\nVL53L0X init (boot):\r\n");
    (void)vl53l0x_init(1U);

    HAL_Delay(50);
    printf("\r\nSCENARIO: stm32 bmp280 + vl53l0x + rotor control\r\n");
    printf("SCENARIO: build=%s %s\r\n", __DATE__, __TIME__);
    printf("SCENARIO: cpu=%lu Hz\r\n", HAL_RCC_GetHCLKFreq());
    printf("SCENARIO: uart=USART1(115200), i2c=I2C1 PB8/PB9\r\n");
    printf("APP_OK\r\n");
    printf("type a command and press Enter (e.g. help)\r\n");
    print_prompt();

    while (1)
    {
        while (usart1_read_byte_nonblocking(&rx_byte))
        {
            uart_process_rx_byte(rx_byte);
        }

        if (cmd_ready)
        {
            cmd_ready = 0;
            process_command((char *)cmd_buffer);
            memset((void *)cmd_buffer, 0, CMD_BUF_SIZE);
            cmd_index = 0;
            print_prompt();
        }

        __WFI();
    }
}

static void print_prompt(void)
{
    printf("> ");
    (void)fflush(stdout);
}

static int usart1_read_byte_nonblocking(uint8_t *byte)
{
    if ((USART1->SR & USART_SR_RXNE) != 0U)
    {
        *byte = (uint8_t)(USART1->DR & 0xFFU);
        return 1;
    }
    return 0;
}

static void uart_process_rx_byte(uint8_t byte)
{
    rx_byte_count++;

    if (byte == '\r')
    {
        rx_last_was_cr = 1U;
        printf("\r\n");
        if (cmd_index > 0U)
        {
            cmd_buffer[cmd_index] = '\0';
            cmd_ready = 1;
        }
        else
        {
            print_prompt();
        }
    }
    else if (byte == '\n')
    {
        if (rx_last_was_cr)
        {
            rx_last_was_cr = 0U;
            return;
        }
        printf("\r\n");
        if (cmd_index > 0U)
        {
            cmd_buffer[cmd_index] = '\0';
            cmd_ready = 1;
        }
        else
        {
            print_prompt();
        }
    }
    else if (byte == '\b' || byte == 0x7FU)
    {
        if (cmd_index > 0U)
        {
            cmd_index--;
            cmd_buffer[cmd_index] = '\0';
            printf("\b \b");
            (void)fflush(stdout);
        }
    }
    else if (byte >= 32U && byte <= 126U)
    {
        rx_last_was_cr = 0U;
        if (cmd_index < (CMD_BUF_SIZE - 1U))
        {
            cmd_buffer[cmd_index++] = (char)byte;
            printf("%c", (char)byte);
            (void)fflush(stdout);
        }
    }
}

static void process_command(char *cmd)
{
    command_count++;

    if (strcmp(cmd, "help") == 0)
    {
        print_help();
    }
    else if (strcmp(cmd, "status") == 0)
    {
        print_status();
    }
    else if (strcmp(cmd, "rotors on") == 0 || strcmp(cmd, "pc10pc11 on") == 0)
    {
        set_rotors(GPIO_PIN_SET);
        printf("ROTORS=ON (PC10=ON, PC11=ON)\r\n");
    }
    else if (strcmp(cmd, "rotors off") == 0 || strcmp(cmd, "pc10pc11 off") == 0)
    {
        set_rotors(GPIO_PIN_RESET);
        printf("ROTORS=OFF (PC10=OFF, PC11=OFF)\r\n");
    }
    else if (strcmp(cmd, "monitor i2c") == 0)
    {
        monitor_i2c_until_key();
    }
    else if (strcmp(cmd, "sensor init") == 0)
    {
        sensor_init_until_key();
    }
    else if (strcmp(cmd, "i2c scan") == 0)
    {
        if (i2c1_ensure_init() == 0)
        {
            i2c_bus_scan();
        }
    }
    else if (strcmp(cmd, "vl53 test") == 0 || strcmp(cmd, "vl53l0x test") == 0)
    {
        if (i2c1_ensure_init() == 0)
        {
            (void)vl53l0x_read_model_id(1U);
        }
    }
    else if (strcmp(cmd, "sensor deinit") == 0)
    {
        (void)sensor_i2c_deinit();
        printf("I2C1 deinitialized; use \"sensor init\", \"i2c scan\", or \"vl53 test\" to run I2C1_Init() again.\r\n");
    }
    else
    {
        printf("unknown: %s\r\n", cmd);
    }
}

static void print_help(void)
{
    printf("commands:\r\n");
    printf("  help\r\n");
    printf("  status\r\n");
    printf("  rotors on\r\n");
    printf("  rotors off\r\n");
    printf("  monitor i2c   (reads BMP280 every 1s, press any key to stop)\r\n");
    printf("  sensor init   (BMP280 + VL53L0X, 500ms retry; I2C scan once at start; any key stops)\r\n");
    printf("  i2c scan      (HAL_I2C_IsDeviceReady 0x08-0x77, highlights 0x29)\r\n");
    printf("  vl53 test     (read VL53L0X model ID reg 0xC0; alias: vl53l0x test)\r\n");
    printf("  sensor deinit (HAL_I2C_DeInit + clear sensor state; re-init via sensor init / i2c scan / vl53 test)\r\n");
}

static void print_status(void)
{
    GPIO_PinState pc10 = HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_10);
    GPIO_PinState pc11 = HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_11);
    int sensor_ok = (bmp280_read_measurement(&g_sensor.temperature_c, &g_sensor.pressure_pa, &g_sensor.altitude_m) == 0);
    if (sensor_ok)
    {
        g_sensor.read_count++;
    }
    else
    {
        g_sensor.read_fail_count++;
    }

    printf("status:\r\n");
    printf("  pc10=%s\r\n", (pc10 == GPIO_PIN_SET) ? "ON" : "OFF");
    printf("  pc11=%s\r\n", (pc11 == GPIO_PIN_SET) ? "ON" : "OFF");
    printf("  bmp280_detected=%s\r\n", g_sensor.detected ? "yes" : "no");
    if (g_sensor.detected)
    {
        printf("  bmp280_addr=0x%02X\r\n", g_sensor.i2c_addr_7b);
    }
    printf("  sensor_initialized=%s\r\n", g_sensor.initialized ? "yes" : "no");
    printf("  vl53l0x_detected=%s last_model_id=0x%02X\r\n",
           g_vl53.detected ? "yes" : "no",
           g_vl53.last_model_id);
    printf("  vl53l0x_initialized=%s last_range_mm=%u read_count=%lu fail_count=%lu\r\n",
           g_vl53.initialized ? "yes" : "no",
           (unsigned int)g_vl53.last_range_mm,
           (unsigned long)g_vl53.read_count,
           (unsigned long)g_vl53.read_fail_count);
    if (sensor_ok)
    {
        printf("  temperature=%.2f C\r\n", g_sensor.temperature_c);
        printf("  pressure=%.2f Pa\r\n", g_sensor.pressure_pa);
        printf("  altitude=%.2f m\r\n", g_sensor.altitude_m);
    }
    else
    {
        printf("  sensor_read=FAILED\r\n");
    }
    printf("  read_count=%lu fail_count=%lu\r\n",
           (unsigned long)g_sensor.read_count,
           (unsigned long)g_sensor.read_fail_count);
    printf("  rx_byte_count=%lu\r\n", (unsigned long)rx_byte_count);
    printf("  command_count=%lu\r\n", (unsigned long)command_count);
    printf("  tick=%lu ms\r\n", (unsigned long)HAL_GetTick());
}

static void set_rotors(GPIO_PinState state)
{
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_10 | GPIO_PIN_11, state);
}

static void monitor_i2c_until_key(void)
{
    uint32_t next_print_ms = HAL_GetTick();
    float last_altitude_m = 0.0f;
    uint8_t have_prev = 0U;

    if (i2c1_ensure_init() != 0)
    {
        printf("monitor aborted: I2C1 init failed\r\n");
        return;
    }
    if (vl53l0x_init(1U) != 0)
    {
        printf("monitor note: VL53L0X init failed (will retry during reads)\r\n");
    }
    printf("monitoring BMP280 + VL53L0X every 1 second (press any key to stop)\r\n");
    while (1)
    {
        if (usart1_read_byte_nonblocking(&rx_byte))
        {
            printf("\r\nmonitor stopped\r\n");
            break;
        }

        uint32_t now = HAL_GetTick();
        if ((int32_t)(now - next_print_ms) >= 0)
        {
            if (bmp280_read_measurement(&g_sensor.temperature_c, &g_sensor.pressure_pa, &g_sensor.altitude_m) == 0)
            {
                g_sensor.read_count++;
                const char *trend = "-";
                if (have_prev)
                {
                    if (g_sensor.altitude_m > (last_altitude_m + 0.05f))
                    {
                        trend = "up";
                    }
                    else if (g_sensor.altitude_m < (last_altitude_m - 0.05f))
                    {
                        trend = "down";
                    }
                    else
                    {
                        trend = "flat";
                    }
                }
                printf("tick=%lu ms temp=%.2f C pressure=%.2f Pa altitude=%.2f m trend=%s\r\n",
                       (unsigned long)now,
                       g_sensor.temperature_c,
                       g_sensor.pressure_pa,
                       g_sensor.altitude_m,
                       trend);
                last_altitude_m = g_sensor.altitude_m;
                have_prev = 1U;
            }
            else
            {
                g_sensor.read_fail_count++;
                printf("tick=%lu ms BMP280 read failed\r\n", (unsigned long)now);
            }
            uint16_t range_mm = 0U;
            if (vl53l0x_read_range_mm(&range_mm, 0U) == 0)
            {
                g_vl53.read_count++;
                printf("tick=%lu ms VL53L0X range=%u mm\r\n",
                       (unsigned long)now,
                       (unsigned int)range_mm);
            }
            else
            {
                g_vl53.read_fail_count++;
                printf("tick=%lu ms VL53L0X read failed\r\n", (unsigned long)now);
            }
            next_print_ms += 1000U;
        }
    }
}

static void sensor_init_until_key(void)
{
    uint32_t next_init_ms = HAL_GetTick();
    uint32_t init_attempt = 0U;
    uint8_t did_scan = 0U;

    if (i2c1_ensure_init() != 0)
    {
        printf("sensor init aborted: I2C1 init failed\r\n");
        return;
    }
    printf("retrying BMP280 + VL53L0X every 500ms (press any key to stop)\r\n");
    while (1)
    {
        if (usart1_read_byte_nonblocking(&rx_byte))
        {
            printf("\r\nsensor init retry stopped\r\n");
            break;
        }

        uint32_t now = HAL_GetTick();
        if ((int32_t)(now - next_init_ms) >= 0)
        {
            if (did_scan == 0U)
            {
                did_scan = 1U;
                printf("one-shot I2C scan:\r\n");
                i2c_bus_scan();
            }
            init_attempt++;
            printf("sensor init attempt=%lu\r\n", (unsigned long)init_attempt);
            if (bmp280_probe_and_init(1U) == 0)
            {
                printf("BMP280 init OK (addr=0x%02X)\r\n", g_sensor.i2c_addr_7b);
            }
            else
            {
                printf("BMP280 init FAILED\r\n");
            }
            printf("VL53L0X init:\r\n");
            if (vl53l0x_init(1U) == 0)
            {
                uint16_t range_mm = 0U;
                if (vl53l0x_read_range_mm(&range_mm, 1U) == 0)
                {
                    g_vl53.read_count++;
                    printf("VL53L0X read OK range=%u mm\r\n", (unsigned int)range_mm);
                }
                else
                {
                    g_vl53.read_fail_count++;
                    printf("VL53L0X init OK, read FAILED\r\n");
                }
            }
            else
            {
                printf("VL53L0X init FAILED\r\n");
            }
            next_init_ms += 500U;
        }
    }
}

