embeddedci-com/examples/scenario-sensors-stm32/main.c
static void i2c_dump_hal_error_bits(uint32_t err)
{
    if (err == 0U)
    {
        return;
    }
    printf(" bits=");
    if ((err & HAL_I2C_ERROR_BERR) != 0U)
    {
        printf("BERR ");
    }
    if ((err & HAL_I2C_ERROR_ARLO) != 0U)
    {
        printf("ARLO ");
    }
    if ((err & HAL_I2C_ERROR_AF) != 0U)
    {
        printf("AF ");
    }
    if ((err & HAL_I2C_ERROR_OVR) != 0U)
    {
        printf("OVR ");
    }
    if ((err & HAL_I2C_ERROR_DMA) != 0U)
    {
        printf("DMA ");
    }
    if ((err & HAL_I2C_ERROR_TIMEOUT) != 0U)
    {
        printf("TIMEOUT ");
    }
}

static void i2c_dump_hal_context(const char *tag, HAL_StatusTypeDef st)
{
    uint32_t err = HAL_I2C_GetError(&g_sensor.hi2c1);
    printf("%s: HAL=%s(%d) err=0x%08lX state=%u prev=%u errCode=0x%08lX",
           tag,
           hal_status_to_str(st),
           (int)st,
           (unsigned long)err,
           (unsigned int)g_sensor.hi2c1.State,
           (unsigned int)g_sensor.hi2c1.PreviousState,
           (unsigned long)g_sensor.hi2c1.ErrorCode);
    i2c_dump_hal_error_bits(err);
    printf("\r\n");
}

static int i2c1_ensure_init(void)
{
    if (g_i2c1_hw_inited != 0U)
    {
        return 0;
    }

    printf("I2C1 init requested\r\n");
    I2C1_Init();
    if (g_i2c1_hw_inited == 0U)
    {
        printf("I2C1 init failed; scan/read operations are blocked\r\n");
        return -1;
    }
    return 0;
}

static void i2c_bus_scan(void)
{
    printf("I2C scan 0x%02X-0x%02X IsDeviceReady(trials=%u to=%ums)\r\n",
           I2C_SCAN_ADDR_FIRST,
           I2C_SCAN_ADDR_LAST,
           (unsigned int)I2C_ISREADY_TRIALS,
           (unsigned int)I2C_ISREADY_TIMEOUT_MS);
    uint32_t found = 0U;
    for (uint32_t a = I2C_SCAN_ADDR_FIRST; a <= I2C_SCAN_ADDR_LAST; a++)
    {
        HAL_StatusTypeDef st = HAL_I2C_IsDeviceReady(&g_sensor.hi2c1,
                                                     (uint16_t)(a << 1),
                                                     I2C_ISREADY_TRIALS,
                                                     I2C_ISREADY_TIMEOUT_MS);
        if (st == HAL_OK)
        {
            printf("  FOUND 0x%02lX", (unsigned long)a);
            if (a == (uint32_t)VL53L0X_I2C_ADDR_7B)
            {
                printf(" (VL53L0X default addr)");
            }
            printf("\r\n");
            found++;
        }
        else
        {
            printf("  0x%02lX: %s", (unsigned long)a, hal_status_to_str(st));
            printf(" err=0x%08lX state=%u", (unsigned long)HAL_I2C_GetError(&g_sensor.hi2c1), (unsigned int)g_sensor.hi2c1.State);
            i2c_dump_hal_error_bits(HAL_I2C_GetError(&g_sensor.hi2c1));
            printf("\r\n");
        }
    }
    printf("scan done: found=%lu device(s)\r\n", (unsigned long)found);
}

static int vl53l0x_read_model_id(uint8_t verbose)
{
    uint8_t val = 0U;
    HAL_StatusTypeDef st = HAL_I2C_Mem_Read(&g_sensor.hi2c1,
                                            (uint16_t)(VL53L0X_I2C_ADDR_7B << 1),
                                            VL53L0X_REG_IDENTIFICATION_MODEL_ID,
                                            I2C_MEMADD_SIZE_8BIT,
                                            &val,
                                            1U,
                                            BMP280_TIMEOUT_MS);
    g_vl53.last_model_id = val;
    if (verbose)
    {
        printf("VL53L0X reg 0x%02X read: %s data=0x%02X (expect 0x%02X)\r\n",
               VL53L0X_REG_IDENTIFICATION_MODEL_ID,
               hal_status_to_str(st),
               val,
               VL53L0X_MODEL_ID_EXPECTED);
        i2c_dump_hal_context("VL53L0X_MemRead", st);
    }
    if (st != HAL_OK)
    {
        g_vl53.detected = 0U;
        return -1;
    }
    g_vl53.detected = (val == VL53L0X_MODEL_ID_EXPECTED) ? 1U : 0U;
    if (val == VL53L0X_MODEL_ID_EXPECTED)
    {
        if (verbose)
        {
            printf("VL53L0X model ID OK\r\n");
        }
        return 0;
    }
    if (verbose)
    {
        printf("VL53L0X model ID mismatch\r\n");
    }
    return -1;
}

static int vl53l0x_init(uint8_t verbose)
{
    if (vl53l0x_read_model_id(verbose) != 0)
    {
        g_vl53.initialized = 0U;
        return -1;
    }
    g_vl53.initialized = 1U;
    if (verbose)
    {
        printf("VL53L0X init OK (basic single-shot ranging)\r\n");
    }
    return 0;
}

static int vl53l0x_read_range_mm(uint16_t *range_mm, uint8_t verbose)
{
    if (range_mm == NULL)
    {
        return -1;
    }
    if (g_vl53.initialized == 0U)
    {
        if (vl53l0x_init(verbose) != 0)
        {
            return -1;
        }
    }

    uint8_t start = 0x01U;
    HAL_StatusTypeDef st = HAL_I2C_Mem_Write(&g_sensor.hi2c1,
                                             (uint16_t)(VL53L0X_I2C_ADDR_7B << 1),
                                             VL53L0X_REG_SYSRANGE_START,
                                             I2C_MEMADD_SIZE_8BIT,
                                             &start,
                                             1U,
                                             BMP280_TIMEOUT_MS);
    if (st != HAL_OK)
    {
        g_vl53.initialized = 0U;
        if (verbose)
        {
            i2c_dump_hal_context("VL53L0X_StartRange", st);
        }
        return -1;
    }

    uint8_t irq_status = 0U;
    uint32_t t0 = HAL_GetTick();
    do
    {
        st = HAL_I2C_Mem_Read(&g_sensor.hi2c1,
                              (uint16_t)(VL53L0X_I2C_ADDR_7B << 1),
                              VL53L0X_REG_RESULT_INTERRUPT_STATUS,
                              I2C_MEMADD_SIZE_8BIT,
                              &irq_status,
                              1U,
                              BMP280_TIMEOUT_MS);
        if (st != HAL_OK)
        {
            g_vl53.initialized = 0U;
            if (verbose)
            {
                i2c_dump_hal_context("VL53L0X_PollReady", st);
            }
            return -1;
        }
        if ((irq_status & VL53L0X_RANGE_READY_MASK) != 0U)
        {
            break;
        }
        HAL_Delay(2U);
    } while ((HAL_GetTick() - t0) < VL53L0X_RANGE_TIMEOUT_MS);

    if ((irq_status & VL53L0X_RANGE_READY_MASK) == 0U)
    {
        g_vl53.initialized = 0U;
        if (verbose)
        {
            printf("VL53L0X range timeout waiting for ready\r\n");
        }
        return -1;
    }

    uint8_t range_buf[2] = {0U, 0U};
    st = HAL_I2C_Mem_Read(&g_sensor.hi2c1,
                          (uint16_t)(VL53L0X_I2C_ADDR_7B << 1),
                          VL53L0X_REG_RESULT_RANGE_MM,
                          I2C_MEMADD_SIZE_8BIT,
                          range_buf,
                          2U,
                          BMP280_TIMEOUT_MS);
    if (st != HAL_OK)
    {
        g_vl53.initialized = 0U;
        if (verbose)
        {
            i2c_dump_hal_context("VL53L0X_ReadRange", st);
        }
        return -1;
    }

    uint8_t clear = 0x01U;
    st = HAL_I2C_Mem_Write(&g_sensor.hi2c1,
                           (uint16_t)(VL53L0X_I2C_ADDR_7B << 1),
                           VL53L0X_REG_SYSTEM_INTERRUPT_CLEAR,
                           I2C_MEMADD_SIZE_8BIT,
                           &clear,
                           1U,
                           BMP280_TIMEOUT_MS);
    if (st != HAL_OK)
    {
        g_vl53.initialized = 0U;
        if (verbose)
        {
            i2c_dump_hal_context("VL53L0X_ClearInterrupt", st);
        }
        return -1;
    }

    *range_mm = (uint16_t)(((uint16_t)range_buf[0] << 8) | (uint16_t)range_buf[1]);
    g_vl53.last_range_mm = *range_mm;
    if (verbose)
    {
        printf("VL53L0X range read: %u mm\r\n", (unsigned int)(*range_mm));
    }
    return 0;
}

static int sensor_i2c_deinit(void)
{
    HAL_StatusTypeDef st = HAL_I2C_DeInit(&g_sensor.hi2c1);
    i2c_dump_hal_context("HAL_I2C_DeInit", st);
    g_i2c1_hw_inited = 0U;
    memset(&g_calib, 0, sizeof(g_calib));
    g_sensor.detected = 0U;
    g_sensor.initialized = 0U;
    g_sensor.i2c_addr_7b = 0U;
    g_vl53.detected = 0U;
    g_vl53.initialized = 0U;
    g_vl53.last_model_id = 0U;
    g_vl53.last_range_mm = 0U;
    g_vl53.read_count = 0U;
    g_vl53.read_fail_count = 0U;
    return (st == HAL_OK) ? 0 : -1;
}

static int32_t bmp280_compensate_temp(int32_t adc_T)
{
    int32_t var1 = ((((adc_T >> 3) - ((int32_t)g_calib.dig_T1 << 1))) * ((int32_t)g_calib.dig_T2)) >> 11;
    int32_t var2 = (((((adc_T >> 4) - ((int32_t)g_calib.dig_T1)) * ((adc_T >> 4) - ((int32_t)g_calib.dig_T1))) >> 12) *
                    ((int32_t)g_calib.dig_T3)) >>
                   14;
    g_calib.t_fine = var1 + var2;
    return (g_calib.t_fine * 5 + 128) >> 8;
}

static uint32_t bmp280_compensate_press(int32_t adc_P)
{
    int64_t var1 = ((int64_t)g_calib.t_fine) - 128000;
    int64_t var2 = var1 * var1 * (int64_t)g_calib.dig_P6;
    var2 = var2 + ((var1 * (int64_t)g_calib.dig_P5) << 17);
    var2 = var2 + (((int64_t)g_calib.dig_P4) << 35);
    var1 = ((var1 * var1 * (int64_t)g_calib.dig_P3) >> 8) + ((var1 * (int64_t)g_calib.dig_P2) << 12);
    var1 = (((((int64_t)1) << 47) + var1) * ((int64_t)g_calib.dig_P1)) >> 33;
    if (var1 == 0)
    {
        return 0;
    }

    int64_t p = 1048576 - adc_P;
    p = (((p << 31) - var2) * 3125) / var1;
    var1 = (((int64_t)g_calib.dig_P9) * (p >> 13) * (p >> 13)) >> 25;
    var2 = (((int64_t)g_calib.dig_P8) * p) >> 19;
    p = ((p + var1 + var2) >> 8) + (((int64_t)g_calib.dig_P7) << 4);
    return (uint32_t)p;
}

